In [2]:
import pandas as pd
import numpy as np

In [5]:
list = [1,2,3,4,5]
df1 = pd.DataFrame(list)
print(type(df1))
print(df1)

<class 'pandas.core.frame.DataFrame'>
   0
0  1
1  2
2  3
3  4
4  5

In [6]:
df1['1열'] = list
df1

   0  1열
0  1   1
1  2   2
2  3   3
3  4   4
4  5   5

In [7]:
df1.columns

Index([0, '1열'], dtype='object')

In [8]:
df2 = df1.rename(columns={0:'0열'})
df2

   0열  1열
0   1   1
1   2   2
2   3   3
3   4   4
4   5   5

In [9]:
score = [
    ['정약용', 70, 80, 100],
    ['이순신', 90, 80, 60],
    ['이율곡', 50, 100, 100]
]
print(type(score))
score

<class 'list'>

[['정약용', 70, 80, 100], ['이순신', 90, 80, 60], ['이율곡', 50, 100, 100]]

In [11]:
df3 = pd.DataFrame(score)
print(type(df3))
df3

<class 'pandas.core.frame.DataFrame'>

     0   1    2    3
0  정약용  70   80  100
1  이순신  90   80   60
2  이율곡  50  100  100

In [15]:
df3.columns = ["이름", "국어", "영어", "수학"]
print(df3.shape)
print(df3)
print(df3.index)

(3, 4)
    이름  국어   영어   수학
0  정약용  70   80  100
1  이순신  90   80   60
2  이율곡  50  100  100
RangeIndex(start=0, stop=3, step=1)

In [16]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   국어      3 non-null      int64
 2   영어      3 non-null      int64
 3   수학      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

In [17]:
df3.describe()

         국어          영어          수학
count   3.0    3.000000    3.000000
mean   70.0   86.666667   86.666667
std    20.0   11.547005   23.094011
min    50.0   80.000000   60.000000
25%    60.0   80.000000   80.000000
50%    70.0   80.000000  100.000000
75%    80.0   90.000000  100.000000
max    90.0  100.000000  100.000000

In [29]:
# dic1 = pd.DataFrame{
#     'coll':[1,2,3,4],
#     'col2':[5,6,7,8]
# }
n = pd.DataFrame({
    'col1':['1','2','3','4'],
    'col2':[5,6,7,8]
})
print(n)

  col1  col2
0    1     5
1    2     6
2    3     7
3    4     8

In [30]:
n.info()
n.dtypes
n.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      object
 1   col2    4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

           col2
count  4.000000
mean   6.500000
std    1.290994
min    5.000000
25%    5.750000
50%    6.500000
75%    7.250000
max    8.000000

In [31]:
n_df = n.astype({'col1':int, 'col2':float})
n_df.dtypes
n_df.describe()

           col1      col2
count  4.000000  4.000000
mean   2.500000  6.500000
std    1.290994  1.290994
min    1.000000  5.000000
25%    1.750000  5.750000
50%    2.500000  6.500000
75%    3.250000  7.250000
max    4.000000  8.000000

In [39]:
display(n_df['col1'])
display(n_df[['col1']])

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

   col1
0     1
1     2
2     3
3     4

In [41]:
for index,row in n_df.iterrows():
    print(row['col2'])

5.0
6.0
7.0
8.0

In [43]:
n_df
n_df['sum'] = n_df['col1'] + n_df['col2']
n_df

   col1  col2   sum
0     1   5.0   6.0
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [44]:
n_df[n_df['sum']>=8]

   col1  col2   sum
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [56]:
# n1_df = n_df[n_df['sum']>=8].reset_index(drop=True)
n1_df = n_df[n_df['sum']>=8]

In [61]:
n1_df.reset_index(drop=True)
# n1_df
n1_sum = n1_df['sum']

In [64]:
type(n1_sum)
n1_sum.shape

(3,)

In [68]:
import pandas as pd

titanic_df = pd.read_csv('data/titanic.csv')
titanic_df
print(titanic_df)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [70]:
len(titanic_df)
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [76]:
titanic_df.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [72]:
titanic_df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [75]:
titanic_df.sort_values(by='age',ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [79]:
titanic_df['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64